<template>
    <div class="container">
        <h2>第9章: 图</h2>
        <h3>图的相关术语</h3>
        <p>图是一种非顺序的数据结构,任何二次元关系都可以用图来表示</p>
        <p>一个图G=(V, E)有以下元素组成</p>
        <p>V:一组顶点</p>
        <p>E:一组边,连接V的顶点</p>
        <p>图的术语</p>
        <p>1.由一条边连接一起的顶点,称为相邻顶点</p>
        <p>2.一个顶点的度是这个顶点的相邻顶点数</p>
        <p>3.路径是顶点的一个连续序列,并且这些顶点两两是相邻顶点</p>
        <p>4.简单路径即没有重复顶点的路径,环是指路径形成一个闭合回路,并且环也是一个简单路径</p>
        <p>5.如果图中不存在环,则称该图无环,如果图中每两个顶点间都存在路径,则图是连通的</p>
        <h4>有向图和无向图</h4>
        
    </div>
</template>

<script>
export default {
    name: 'Map',
    data() {
        return {

        };
    }
}
</script>

<style scoped>

</style>